package lesson5;

import java.util.Scanner;

public class Main1 {
    public static void main(String[] args) {
        String[][] tours = {{"Италия", "40000", "7 дней", "самолет", "4 звезды"},
                {"Франция", "50000", "5 дней", "самолет", "4 звезды"},
                {"Норвегия", "86000", "6 дней", "автобус", "3 звезды"},
                {"Греция", "110000", "7 дней", "самолет", "5 звезды"},
                {"Мальдивы", "200000", "14 дней", "самолет", "3 звезды"},
                {"Мальдивы", "99000", "10 дней", "лайнер", "4 звезды"},
                {"Италия", "250000", "8 дней", "автобус", "3 звезды"},
                {"Италия", "61000", "11 дней", "самолет", "4 звезды"}};
        // 1 - выбор тура по бюджету
        Scanner scanner = new Scanner(System.in);
        System.out.println("На какой бюджет расчитываете?");
        String moneyToTrip = scanner.nextLine();

        TourUtils.printToursBuyMoney(tours, moneyToTrip);

        // 2 - выбор тура по стране (дома)
        // 3 - печать средняя стоимость тура куда угодно
        // 4 - печать средняя соимость тура в страну...
        // 5 - печатать туры от ... дней и далее (задает пользователь)(дома)

        TourUtils.printAverageCost(tours);
    }
}
